export const regions = {
  "Marmara": ["10", "11", "16", "17", "22", "34", "39", "41", "54", "59", "77"],
  "Ege": ["03", "09", "20", "35", "43", "45", "48", "64"],
  "Akdeniz": ["01", "07", "15", "31", "32", "33", "46", "80"],
  "İç Anadolu": ["06", "18", "26", "38", "40", "42", "50", "51", "58", "66", "68", "70", "71"],
  "Karadeniz": ["05", "08", "14", "19", "28", "29", "37", "52", "53", "55", "57", "60", "61", "67", "69", "74", "78", "81"],
  "Doğu Anadolu": ["04", "12", "13", "23", "24", "25", "30", "36", "44", "49", "62", "65", "73", "75", "76"],
  "Güneydoğu Anadolu": ["02", "21", "27", "47", "56", "63", "72", "79"]
};

export const getCityRegion = (plate) => {
  for (const [regionName, plates] of Object.entries(regions)) {
    if (plates.includes(plate)) {
      return regionName;
    }
  }
  return "Bilinmeyen";
};
